//Задайте строку, содержащую латинские буквы в обоих регистрах.
//Сформируйте строку, в которой все заглавные буквы заменены на строчные.

string str = "AbCdEfG!-";
string newStr = str.ToLower();
Console.WriteLine(str);
Console.WriteLine(newStr);